remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam/boards/sam4e_xplained_pro/sam4e_xplained_pro.h
#define PIN_EBI_ADDR_BUS_A0        PIO_PC18_IDX
#define PIN_EBI_ADDR_BUS_A1        PIO_PC19_IDX
#define PIN_EBI_ADDR_BUS_A2        PIO_PC20_IDX
#define PIN_EBI_ADDR_BUS_A3        PIO_PC21_IDX
#define PIN_EBI_ADDR_BUS_A4        PIO_PC22_IDX
#define PIN_EBI_ADDR_BUS_A5        PIO_PC23_IDX
#define PIN_EBI_ADDR_BUS_A6        PIO_PC24_IDX
#define PIN_EBI_ADDR_BUS_A7        PIO_PC25_IDX
#define PIN_EBI_ADDR_BUS_A8        PIO_PC26_IDX
#define PIN_EBI_ADDR_BUS_A9        PIO_PC27_IDX
#define PIN_EBI_ADDR_BUS_A10       PIO_PC28_IDX
#define PIN_EBI_ADDR_BUS_A11       PIO_PC29_IDX
#define PIN_EBI_ADDR_BUS_A12       PIO_PC30_IDX
#define PIN_EBI_ADDR_BUS_A13       PIO_PC31_IDX
#define PIN_EBI_ADDR_BUS_FLAG1     IOPORT_MODE_MUX_A
#define PIN_EBI_ADDR_BUS_A14       PIO_PA18_IDX
#define PIN_EBI_ADDR_BUS_A15       PIO_PA19_IDX
#define PIN_EBI_ADDR_BUS_A16       PIO_PA20_IDX
#define PIN_EBI_ADDR_BUS_A17       PIO_PA0_IDX
#define PIN_EBI_ADDR_BUS_A18       PIO_PA1_IDX
#define PIN_EBI_ADDR_BUS_FLAG2     IOPORT_MODE_MUX_C

#define PIN_EBI_NRD                PIO_PC11_IDX
#define PIN_EBI_NRD_FLAGS          IOPORT_MODE_MUX_A
#define PIN_EBI_NWE                PIO_PC8_IDX
#define PIN_EBI_NWE_FLAGS          IOPORT_MODE_MUX_A
#define PIN_EBI_NCS1               PIO_PD18_IDX
#define PIN_EBI_NCS1_FLAGS         IOPORT_MODE_MUX_A
#define PIN_EBI_NCS3               PIO_PD19_IDX
#define PIN_EBI_NCS3_FLAGS         IOPORT_MODE_MUX_A

/* SRAM base address */
#define SRAM_BASE_ADDRESS          EBI_CS1_ADDR
#define SRAM_BASE_ADDRESS_2ND      EBI_CS3_ADDR

/* SRAM chip select */
#define SRAM_CHIP_SELECT           1
#define SRAM_CHIP_SELECT_2ND       3

/* KSZ8051MNL relate PIN definition */
#define PIN_KSZ8051MNL_RXC_IDX                 PIO_PD14_IDX
#define PIN_KSZ8051MNL_RXC_FLAGS             (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_TXC_IDX                 PIO_PD0_IDX
#define PIN_KSZ8051MNL_TXC_FLAGS             (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_TXEN_IDX                PIO_PD1_IDX
#define PIN_KSZ8051MNL_TXEN_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_TXD3_IDX                PIO_PD16_IDX
#define PIN_KSZ8051MNL_TXD3_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_TXD2_IDX                PIO_PD15_IDX
#define PIN_KSZ8051MNL_TXD2_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_TXD1_IDX                PIO_PD3_IDX
#define PIN_KSZ8051MNL_TXD1_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_TXD0_IDX                PIO_PD2_IDX
#define PIN_KSZ8051MNL_TXD0_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_RXD3_IDX                PIO_PD12_IDX
#define PIN_KSZ8051MNL_RXD3_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_RXD2_IDX                PIO_PD11_IDX
#define PIN_KSZ8051MNL_RXD2_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_RXD1_IDX                PIO_PD6_IDX
#define PIN_KSZ8051MNL_RXD1_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_RXD0_IDX                PIO_PD5_IDX
#define PIN_KSZ8051MNL_RXD0_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_RXER_IDX                PIO_PD7_IDX
#define PIN_KSZ8051MNL_RXER_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_RXDV_IDX                PIO_PD4_IDX
#define PIN_KSZ8051MNL_RXDV_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_CRS_IDX                 PIO_PD10_IDX
#define PIN_KSZ8051MNL_CRS_FLAGS             (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_COL_IDX                 PIO_PD13_IDX
#define PIN_KSZ8051MNL_COL_FLAGS             (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_MDC_IDX                 PIO_PD8_IDX
#define PIN_KSZ8051MNL_MDC_FLAGS             (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_MDIO_IDX                PIO_PD9_IDX
#define PIN_KSZ8051MNL_MDIO_FLAGS            (IOPORT_MODE_MUX_A)
#define PIN_KSZ8051MNL_INTRP_IDX               PIO_PD28_IDX

/** NandFlash pins definition: OE. */
#define PIN_EBI_NANDOE    (PIO_PC9_IDX)
#define PIN_EBI_NANDOE_FLAGS    (IOPORT_MODE_MUX_A)

/** NandFlash pins definition: WE. */
#define PIN_EBI_NANDWE    (PIO_PC10_IDX)
#define PIN_EBI_NANDWE_FLAGS    (IOPORT_MODE_MUX_A)

/** NandFlash pins definition: CLE. */
#define PIN_EBI_NANDCLE    (PIO_PC17_IDX)
#define PIN_EBI_NANDCLE_FLAGS    (IOPORT_MODE_MUX_A)

/** NandFlash pins definition: ALE. */
#define PIN_EBI_NANDALE    (PIO_PC16_IDX)
#define PIN_EBI_NANDALE_FLAGS    (IOPORT_MODE_MUX_A)

/** NandFlash pins definition: DATA. */
#define PIN_EBI_NANDIO_0    (PIO_PC0_IDX)
#define PIN_EBI_NANDIO_0_FLAGS    (IOPORT_MODE_MUX_A)

#define PIN_EBI_NANDIO_1    (PIO_PC1_IDX)
#define PIN_EBI_NANDIO_1_FLAGS    (IOPORT_MODE_MUX_A)

#define PIN_EBI_NANDIO_2    (PIO_PC2_IDX)
#define PIN_EBI_NANDIO_2_FLAGS    (IOPORT_MODE_MUX_A)

#define PIN_EBI_NANDIO_3    (PIO_PC3_IDX)
#define PIN_EBI_NANDIO_3_FLAGS    (IOPORT_MODE_MUX_A)

#define PIN_EBI_NANDIO_4    (PIO_PC4_IDX)
#define PIN_EBI_NANDIO_4_FLAGS    (IOPORT_MODE_MUX_A)

#define PIN_EBI_NANDIO_5    (PIO_PC5_IDX)
#define PIN_EBI_NANDIO_5_FLAGS    (IOPORT_MODE_MUX_A)

#define PIN_EBI_NANDIO_6    (PIO_PC6_IDX)
#define PIN_EBI_NANDIO_6_FLAGS    (IOPORT_MODE_MUX_A)

#define PIN_EBI_NANDIO_7    (PIO_PC7_IDX)
#define PIN_EBI_NANDIO_7_FLAGS    (IOPORT_MODE_MUX_A)

/** Nandflash chip enable pin definition. */
#define PIN_NF_CE_IDX    (PIO_PC14_IDX)

/** Nandflash ready/busy pin definition. */
/* The new board use this definition */
#define PIN_NF_RB_IDX    (PIO_PB12_IDX)
/* The old board use this definition */
//#define PIN_NF_RB_IDX    (PIO_PD10_IDX)

/* Chip select number for nand */
#define BOARD_NAND_CS    0

/*----------------------------------------------------------------------------*/
/**
 * \page sam4e_xpro_usb "SAM4E-XPRO - USB device"
 *
 * \section Definitions
 * - \ref BOARD_USB_BMATTRIBUTES
 * - \ref CHIP_USB_UDP
 * - \ref CHIP_USB_PULLUP_INTERNAL
 * - \ref CHIP_USB_NUMENDPOINTS
 * - \ref CHIP_USB_ENDPOINTS_MAXPACKETSIZE
 * - \ref CHIP_USB_ENDPOINTS_BANKS
 */

/**
 * USB attributes configuration descriptor (bus or self powered,
 * remote wakeup)
 */
#define BOARD_USB_BMATTRIBUTES  USBConfigurationDescriptor_SELFPOWERED_RWAKEUP

/** Indicates chip has an UDP Full Speed. */
#define CHIP_USB_UDP

